<!-- add-pr-comment:add-pr-comment -->

```
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.weekly_exercise.module.lb.azurerm_lb.my_lb will be created
  + resource "azurerm_lb" "my_lb" {
      + id                   = (known after apply)
      + location             = "westeurope"
      + name                 = "lb-weekly"
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = "rg1icasado-lab01"
      + sku                  = "Standard"
      + sku_tier             = "Regional"

      + frontend_ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + id                                                 = (known after apply)
          + inbound_nat_rules                                  = (known after apply)
          + load_balancer_rules                                = (known after apply)
          + name                                               = "lb-weekly-public-ip"
          + outbound_rules                                     = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = (known after apply)
          + private_ip_address_version                         = (known after apply)
          + public_ip_address_id                               = (known after apply)
          + public_ip_prefix_id                                = (known after apply)
          + subnet_id                                          = (known after apply)
        }
    }

  # module.weekly_exercise.module.lb.azurerm_lb_backend_address_pool.my_lb_pool will be created
  + resource "azurerm_lb_backend_address_pool" "my_lb_pool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + inbound_nat_rules         = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "lb-weekly-pool"
      + outbound_rules            = (known after apply)
    }

  # module.weekly_exercise.module.lb.azurerm_network_interface_backend_address_pool_association.my_nic_lb_pool[0] will be created
  + resource "azurerm_network_interface_backend_address_pool_association" "my_nic_lb_pool" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_configuration_name   = "ipconfig0"
      + network_interface_id    = (known after apply)
    }

  # module.weekly_exercise.module.lb.azurerm_network_interface_backend_address_pool_association.my_nic_lb_pool[1] will be created
  + resource "azurerm_network_interface_backend_address_pool_association" "my_nic_lb_pool" {
      + backend_address_pool_id = (known after apply)
      + id                      = (known after apply)
      + ip_configuration_name   = "ipconfig1"
      + network_interface_id    = (known after apply)
    }

  # module.weekly_exercise.module.lb.module.lb_probe_and_rules.azurerm_lb_outbound_rule.my_lboutbound_rule["outbound-rule-1"] will be created
  + resource "azurerm_lb_outbound_rule" "my_lboutbound_rule" {
      + allocated_outbound_ports = 1024
      + backend_address_pool_id  = (known after apply)
      + enable_tcp_reset         = false
      + id                       = (known after apply)
      + idle_timeout_in_minutes  = 4
      + loadbalancer_id          = (known after apply)
      + name                     = "outbound-rule-1"
      + protocol                 = "Tcp"

      + frontend_ip_configuration {
          + id   = (known after apply)
          + name = "lb-weekly-public-ip"
        }
    }

  # module.weekly_exercise.module.lb.module.lb_probe_and_rules.azurerm_lb_probe.my_lb_probe will be created
  + resource "azurerm_lb_probe" "my_lb_probe" {
      + id                  = (known after apply)
      + interval_in_seconds = 15
      + load_balancer_rules = (known after apply)
      + loadbalancer_id     = (known after apply)
      + name                = "weekly-lb-probe"
      + number_of_probes    = 2
      + port                = 80
      + probe_threshold     = 1
      + protocol            = "Tcp"
    }

  # module.weekly_exercise.module.lb.module.lb_probe_and_rules.azurerm_lb_rule.my_lb_rule["rule-1"] will be created
  + resource "azurerm_lb_rule" "my_lb_rule" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 80
      + disable_outbound_snat          = true
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "lb-weekly-public-ip"
      + frontend_port                  = 80
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "rule-1"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # module.weekly_exercise.module.lb.module.lb_probe_and_rules.azurerm_lb_rule.my_lb_rule["rule-2"] will be created
  + resource "azurerm_lb_rule" "my_lb_rule" {
      + backend_address_pool_ids       = (known after apply)
      + backend_port                   = 8443
      + disable_outbound_snat          = true
      + enable_floating_ip             = false
      + frontend_ip_configuration_id   = (known after apply)
      + frontend_ip_configuration_name = "lb-weekly-public-ip"
      + frontend_port                  = 443
      + id                             = (known after apply)
      + idle_timeout_in_minutes        = (known after apply)
      + load_distribution              = (known after apply)
      + loadbalancer_id                = (known after apply)
      + name                           = "rule-2"
      + probe_id                       = (known after apply)
      + protocol                       = "Tcp"
    }

  # module.weekly_exercise.module.vnet.module.lb_public_ip.azurerm_public_ip.lb_public_ip will be created
  + resource "azurerm_public_ip" "lb_public_ip" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "lb-weekly-public-ip"
      + resource_group_name     = "rg1icasado-lab01"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # module.weekly_exercise.module.vnet.module.nic.azurerm_network_interface.nic[0] will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "westeurope"
      + mac_address                   = (known after apply)
      + name                          = "weekly-nic0"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg1icasado-lab01"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig0"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.weekly_exercise.module.vnet.module.nic.azurerm_network_interface.nic[1] will be created
  + resource "azurerm_network_interface" "nic" {
      + applied_dns_servers           = (known after apply)
      + dns_servers                   = (known after apply)
      + enable_accelerated_networking = false
      + enable_ip_forwarding          = false
      + id                            = (known after apply)
      + internal_dns_name_label       = (known after apply)
      + internal_domain_name_suffix   = (known after apply)
      + location                      = "westeurope"
      + mac_address                   = (known after apply)
      + name                          = "weekly-nic1"
      + private_ip_address            = (known after apply)
      + private_ip_addresses          = (known after apply)
      + resource_group_name           = "rg1icasado-lab01"
      + virtual_machine_id            = (known after apply)

      + ip_configuration {
          + gateway_load_balancer_frontend_ip_configuration_id = (known after apply)
          + name                                               = "ipconfig1"
          + primary                                            = (known after apply)
          + private_ip_address                                 = (known after apply)
          + private_ip_address_allocation                      = "Dynamic"
          + private_ip_address_version                         = "IPv4"
          + subnet_id                                          = (known after apply)
        }
    }

  # module.weekly_exercise.module.vnet.module.nsg.azurerm_network_security_group.my_nsg will be created
  + resource "azurerm_network_security_group" "my_nsg" {
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "weekly-nsg"
      + resource_group_name = "rg1icasado-lab01"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + destination_address_prefix                 = "*"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "80"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "web"
              + priority                                   = 1008
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "*"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
    }

  # module.weekly_exercise.module.vnet.module.nsg.azurerm_subnet_network_security_group_association.my_nsg_association will be created
  + resource "azurerm_subnet_network_security_group_association" "my_nsg_association" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.weekly_exercise.module.vnet.module.rg.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg1icasado-lab01"
    }

  # module.weekly_exercise.module.vnet.module.subnet.azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "weekly-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "rg1icasado-lab01"
      + virtual_network_name                           = "weekly-vnet"
    }

  # module.weekly_exercise.module.vnet.module.vms.azurerm_linux_virtual_machine.vm["0"] will be created
  + resource "azurerm_linux_virtual_machine" "vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "adminuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "westeurope"
      + max_bid_price                                          = -1
      + name                                                   = "vm1"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg1icasado-lab01"
      + size                                                   = "Standard_F2"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = "vm-1-disk_weekly"
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }
    }

  # module.weekly_exercise.module.vnet.module.vms.azurerm_linux_virtual_machine.vm["1"] will be created
  + resource "azurerm_linux_virtual_machine" "vm" {
      + admin_password                                         = (sensitive value)
      + admin_username                                         = "adminuser"
      + allow_extension_operations                             = true
      + bypass_platform_safety_checks_on_user_schedule_enabled = false
      + computer_name                                          = (known after apply)
      + disable_password_authentication                        = true
      + disk_controller_type                                   = (known after apply)
      + extensions_time_budget                                 = "PT1H30M"
      + id                                                     = (known after apply)
      + location                                               = "westeurope"
      + max_bid_price                                          = -1
      + name                                                   = "vm2"
      + network_interface_ids                                  = (known after apply)
      + patch_assessment_mode                                  = "ImageDefault"
      + patch_mode                                             = "ImageDefault"
      + platform_fault_domain                                  = -1
      + priority                                               = "Regular"
      + private_ip_address                                     = (known after apply)
      + private_ip_addresses                                   = (known after apply)
      + provision_vm_agent                                     = true
      + public_ip_address                                      = (known after apply)
      + public_ip_addresses                                    = (known after apply)
      + resource_group_name                                    = "rg1icasado-lab01"
      + size                                                   = "Standard_F2"
      + virtual_machine_id                                     = (known after apply)
      + vm_agent_platform_updates_enabled                      = false

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + name                      = "vm-2-disk_weekly"
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "0001-com-ubuntu-server-jammy"
          + publisher = "Canonical"
          + sku       = "22_04-lts"
          + version   = "latest"
        }
    }

  # module.weekly_exercise.module.vnet.module.vms.azurerm_virtual_machine_extension.my_vm_extension["0"] will be created
  + resource "azurerm_virtual_machine_extension" "my_vm_extension" {
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "Nginx"
      + publisher                   = "Microsoft.Azure.Extensions"
      + settings                    = <<-EOT
            {
              "commandToExecute": "sudo apt-get update && sudo apt-get install nginx -y && echo \"Hello World from $(hostname)\" > /var/www/html/index.html && sudo systemctl restart nginx"
             }
        EOT
      + type                        = "CustomScript"
      + type_handler_version        = "2.0"
      + virtual_machine_id          = (known after apply)
    }

  # module.weekly_exercise.module.vnet.module.vms.azurerm_virtual_machine_extension.my_vm_extension["1"] will be created
  + resource "azurerm_virtual_machine_extension" "my_vm_extension" {
      + failure_suppression_enabled = false
      + id                          = (known after apply)
      + name                        = "Nginx"
      + publisher                   = "Microsoft.Azure.Extensions"
      + settings                    = <<-EOT
            {
              "commandToExecute": "sudo apt-get update && sudo apt-get install nginx -y && echo \"Hello World from $(hostname)\" > /var/www/html/index.html && sudo systemctl restart nginx"
             }
        EOT
      + type                        = "CustomScript"
      + type_handler_version        = "2.0"
      + virtual_machine_id          = (known after apply)
    }

  # module.weekly_exercise.module.vnet.module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "westeurope"
      + name                = "weekly-vnet"
      + resource_group_name = "rg1icasado-lab01"
      + subnet              = (known after apply)
    }

Plan: 20 to add, 0 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```